
{
  "name": "Malachi Ezeabuchukwu",
  "headerTaglineOne": "Hello 👋",
  "headerTaglineTwo": "I'm Malachi Ezeabuchukwu - Adept",
  "headerTaglineThree": "Software Developer.",
  "headerTaglineFour": "Well-versed with React, Javascript, Wordpress, Next13, Nodejs, Mongodb...",
  "showCursor": true,
  "showBlog": true,
  "darkMode": true,
  "showResume": true,
  "socials": [
    {
      "id": "1",
      "title": "Github",
      "link": "https://github.com/malachitech"
    },
    {
      "id": "2",
      "title": "LinkedIn",
      "link": "https://www.linkedin.com/in/malachi-ezeabuchukwu-a21591271/"
    },
    {
      "id": "3",
      "title": "Twitter",
      "link": "https://twitter.com/MalachiTochukwu"
    },
    
    { "id": "4", "title": "Email", "link": "mailto:tmezeh9@gmail.com" },
    { "id": "5", "title": "My Resume", "link": "/resume" }

  ], 
  "projects": [
    {
      "id": "1",
      "title": "Boardman Betting Platform",
      "description": "Nextjs, React, Javascript.",
      "imageSrc": "/testImage/tradingbot.png",
      "url": "https://github.com/malachitech/DMoonTradeBot"
    },
    {
      "id": "8",
      "title": "DMoonTradeBot",
      "description": "Python, SolonaaRPC, Railway, sqlite3, flask, cryptography, Telegram, Jupiter API. DMoonTradeBot is a secure and fully asynchronous Telegram-based trading assistant built on the Solana blockchain. It enables users to monitor balances, set trading targets, and execute transactions using encrypted wallets. The bot integrates the Solana RPC, Jupiter API, and real-time rate-limiting to ensure both performance and user safety.",
      "imageSrc": "/testImage/boardman.png",
      "url": "https://boardmanbets.vercel.app/"
    },
    
    {
      "id": "7",
      "title": "Banking App Demo",
      "description": "Mongodb, Postman, React, Javascript. Boardman Bets is a sleek, user-centric sports betting platform designed for modern punters. Featuring a clean, intuitive interface, it allows users to manage their betting wallet, track deposits, withdrawals, and transaction history.",
      "imageSrc": "/testImage/projectOne(eastdale).PNG",
      "url": "https://eastdalefinance.onrender.com/"
    },
    {
      "id": "2",
      "title": "Lifetechies",
      "description": "A team of experienced and growing techies, dedicated and determined to always bring out the best in your product ideas.",
      "imageSrc": "https://malachiportfolio.netlify.app/imgs/projecttwo(liftechies).PNG",
      "url": "https://lifetechies.netlify.app/"
    },
    {
      "id": "3",
      "title": "Inventory & Stock Management Solution",
      "description": "Inventory system to control and manage proucts in the warehouse in real timeand integrated to make it easier to develop your business.",
      "imageSrc": "https://malachiportfolio.netlify.app/imgs/projectthree(pinvent).PNG",
      "url": "https://pinvent.vercel.app/"
    },
    {
      "id": "4",
      "title": "adeshinaajayi.com",
      "description": "WordPress, CSS, PHP, Javascript.\r\nADESHINA AJAYI is a Nigerian tech visionary, leader, author and tech educator. This portfolio is a landing page that showcases his expertise and provide links to reaching him from anywhere in the world.",
      "imageSrc": "/testImage/aatag.png",
      "url": "https://adeshinaajayi.com/"
    },
    {
      "id": "5",
      "title": "digital-focus.org",
      "description": "WordPress, CSS, PHP, Javascript.\r\nDigital Focus is dedicated to demystifying blockchain technology and empowering individuals and businesses to harness its full potential. As a premier blockchain consulting and education company, they offer a comprehensive suite of services tailored to meet the unique needs of blockchain enthusiasts.",
      "imageSrc": "/testImage/digfuzprev.png",
      "url": "https://digital-focus.org/"
    },
    {
      "id": "6",
      "title": "Miss New Jersey USA (Personal profile)",
      "description": "WordPress, CSS, PHP, Javascript, SEO, woocommerce.\r\nDerby Ozioma Chukwudi is Miss New Jersey USA 2023 and a 1st generation Nigerian-American born in Dallas, TX. This portfolio beautifully showcases her expertise, provides a marketplace for her publications and provide links to reaching her from anywhere in the world.",
      "imageSrc": "/testImage/derby.png",
      "url": "https://derbyoziomachukwudi.com/"
    }
  ],
  "services": [
    
    {
      "id": "1",
      "title": "Full Stack Web Development With React, Next13, Nodejs, Mongodb.",
      "description": "I build and optimize your online presence.  Website is the digital entry point into your business and a powerful revenue channel."
    },
    {
      "id": "2",
      "title": "Web Development With Wordpress and Woocommerce.",
      "description": "I combine creative design and technical skills to build website with wordpress and woocommerce."
    }
    
  ],
  "aboutpara": "Adept Software Developer with 4+ years of experience in building functional and modern full stack websites. I Leverage technical, analytical, and problem-solving skills to create high-performance Restful API endpoints and user interfaces that fuels competitive advantage and revenue growth.I get excited about opportunities where I create #MERN stack applications. Seeing the beauty and the problem it solves is amazing.I love connecting with new people, you can reach me at tmezeh9@gmail.com.",
  "resume": {
    "tagline": "👋  I'm a software Developer.",
    "description": "I have delivered amazing websites with great user experiences to clients. Well-versed with React, Javascript, Next13.",
    "experiences": [
      {
        "id": "4",
        "dates": "January 2025 - Till Date",
        "type": "Full Time",
        "position": "Fullstack Developer at Iksha Training Labs. Iksha provides Best of Training & Services. Revolutionalizing the information technology industry through training and services to other industries.",
        "bullets": "Deliver Technical Training on full stack development programming languages (e.g. JavaScript Python) frameworks and DevOps tools., Mentor Students and Junior Developers through hands-on projects and personalized guidance., Organize Workshops & Webinars on emerging technologies and software engineering best practices., Manage Databases using SQL (MySQL) and NoSQL (MongoDB)., Deploy and Maintain Applications on cloud platforms (AWS Vercel DigitalOcean etc.)., Implement CI/CD Pipelines and automate development workflows."
      },
      {
        "id": "1",
        "dates": "April 2023 - September 2023",
        "type": "Contract",
        "position": "Fullstack Developer at imprxx.com",
        "bullets": "Assisted in the integration of third-party APIs and services to enhance application functionality, Built core frontend  functionalities that allowed for proper role management, user activities and state management, Developed dynamic routing for every type of user, Created backend functionalities for users to perform CRUD activities on the site, Achieved a 25% reduction in page load times through performance optimization techniques, Participated in sprint planning meetings and daily stand-ups to track progress and prioritize tasks "
      },
      {
        "id": "d495c23b-4f65-479a-9b8a-cfbc1c089725",
        "dates": "Feb 2023 - March 2023",
        "type": "Contract",
        "position": "Software Developer at Crystal hills software group",
        "bullets": "Designed and implemented RESTful APIs for data retrieval and manipulation and ensuring data consistency and security, Address security concerns including data validation secure API endpoints and protection against common web vulnerabilities, Assisted in the development of a dynamic e-commerce platform while gaining proficiency in React.js and Node.js "
      },
      {
        "id": "7888uud495c23b-4f65-479a-9b8a",
        "dates": "March 2022 - Oct. 2022",
        "type": "Full Time",
        "position": "Front End Developer at IT Skills Center",
        "bullets": "Collaborated with designers to translate wireframes and mockups into visually appealing and user-friendly web interfaces. Ensure a consistent and aesthetically pleasing design across all pages, Write clean maintainable and efficient HTML CSS and JavaScript code to implement UI designs. Ensure cross-browser compatibility and responsive design to work seamlessly on various devices and screen sizes."
      }
    ],
    "education": {
      "universityName": "IT Skills",
      "universityDate": "March 2022- Oct 2022",
      "universityPara": "Learnt and also worked as a Software Developer"
    },
    "frontend": ["Javascript", "Wordpress", "HTML5", "CSS3", "React and  Next13", "Python","TailwindCSS", "Material UI"],
    "backend": ["Node.js", "Express.js", "JWT", "MongoDB", "MySQL", "PHP",  "SolanaRPC", "cryptography", "Squlite3"],
    "others": ["Redux", "Git", "NPM", "Vite", "Postman", "Heroku", "Vercel"]
  }
}
